In [134]:
import numpy as np
import pandas as pd

In [135]:
sozluk1={"Isim":["Ahmet","Mehmet","Zeynep","Atil"],"Spor":["Kosu","Yuzme","kosu","Basketbol"],
         "Kalori":[100,200,300,400]}

In [136]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [137]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       kosu     300
3    Atil  Basketbol     400

In [138]:
sozluk2={"Isim":["Osman","Levent","Atlas","Fatma"],
         "Spor":["Kosu","Yuzme","kosu","Basketbol"],
         "Kalori":[200,100,50,300]}

In [139]:
dataFrame2=pd.DataFrame(sozluk2,index = [4,5,6,7])

In [140]:
sozluk3={"Isim":["Ayse","Mahmut","Duygu","Nur"],
         "Spor":["Kosu","Yuzme","Badminton","Tenis"],
         "Kalori":[300,400,500,250]}

In [141]:
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [142]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       kosu     300
3    Atil  Basketbol     400

In [143]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Kosu     200
5  Levent      Yuzme     100
6   Atlas       kosu      50
7   Fatma  Basketbol     300

In [144]:
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Kosu     300
9   Mahmut      Yuzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

3 adet birbirinden farkli tablo yaptik ve bunlari birlestirmeye calisacagiz

# Concatenation

In [145]:
pd.concat([dataFrame1,dataFrame2,dataFrame3]) # tamamen birlestiriyor duzgun ve dogru sekilde

      Isim       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yuzme     200
2   Zeynep       kosu     300
3     Atil  Basketbol     400
4    Osman       Kosu     200
5   Levent      Yuzme     100
6    Atlas       kosu      50
7    Fatma  Basketbol     300
8     Ayse       Kosu     300
9   Mahmut      Yuzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

In [146]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=1) #yan yana koymaya calisiyor ,

,Isim,Spor,Kalori,Isim,Spor,Kalori,Isim,Spor,Kalori
0,Ahmet,Kosu,100.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Mehmet,Yuzme,200.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Zeynep,kosu,300.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Atil,Basketbol,400.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,Osman,Kosu,200.0,NaN,NaN,NaN
5,NaN,NaN,NaN,Levent,Yuzme,100.0,NaN,NaN,NaN
6,NaN,NaN,NaN,Atlas,kosu,50.0,NaN,NaN,NaN
7,NaN,NaN,NaN,Fatma,Basketbol,300.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,Ayse,Kosu,300.0
9,NaN,NaN,NaN,NaN,NaN,NaN,Mahmut,Yuzme,400.0
10,NaN,NaN,NaN,NaN,NaN,NaN,Duygu,Badminton,500.0
11,NaN,NaN,NaN,NaN,NaN,NaN,Nur,Tenis,250.0

In [147]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0) #dogru sekilde yazar 
#axis yazilmazsa axis =0 demektir

      Isim       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yuzme     200
2   Zeynep       kosu     300
3     Atil  Basketbol     400
4    Osman       Kosu     200
5   Levent      Yuzme     100
6    Atlas       kosu      50
7    Fatma  Basketbol     300
8     Ayse       Kosu     300
9   Mahmut      Yuzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

# Merge

In [148]:
#bu da birleştirmek/kaynaştırmak

In [149]:
mergesozluk1={"Isim":["Ahmet","Mehmet","Zeynep","Atil"],
             "Spor":["Kosu","Yuzme","Kosu","Basketbol"]}

In [150]:
mergeDataFrame1=pd.DataFrame(mergesozluk1)

In [151]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Kosu
1  Mehmet      Yuzme
2  Zeynep       Kosu
3    Atil  Basketbol

In [152]:
mergesozluk2={"Isim":["Ahmet","Mehmet","Zeynep","Atil"],
             "Kalori":[100,200,150,250]}

In [153]:
mergeDataFrame2=pd.DataFrame(mergesozluk2)

In [154]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atil     250

USTTEKİ TABLOLARİN BİRİNDE KALORİ VAR SPOR YOK 
DİGERİNDE SPOR VAR KALORİ YOK
BİRLEŞTİRECEGİZ

In [155]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")
#Hangi Kolon Uzerinden İslem Yapilacaksa on ile belirtiyoruz
# En Son Ortak Yerden Gerisini Bİrleştirir

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     150
3    Atil  Basketbol     250

In [156]:
maasSozluk={"Isim":["Abdullah","Semih","Turhan"],
           "Departman":["Yazilim","Satis","Yazilim"],
           "Maas":[200,300,400]}

In [157]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [158]:
maasDataFrame

       Isim Departman  Maas
0  Abdullah   Yazilim   200
1     Semih     Satis   300
2    Turhan   Yazilim   400

In [159]:
# 2 yazilimi birlestirmeye calisacagiz

In [160]:
maasDataFrame["Departman"].unique() #unique = kendine has, ayni olan Departmanlari birlestirir

array(['Yazilim', 'Satis'], dtype=object)

In [161]:
maasDataFrame["Departman"].nunique() #kac farkli tur departman var

2

In [162]:
maasDataFrame["Departman"].value_counts() # hangi departmandan kac kisi var,kac oge var

Yazilim    2
Satis      1
Name: Departman, dtype: int64

In [163]:
def BruttenNetMaasa(maas):
    return maas * 0.66

In [164]:
maasDataFrame["Maas"].apply(BruttenNetMaasa) # maaslari  0.66 ya carptiran bir fonksiyon yaptik

0    132.0
1    198.0
2    264.0
Name: Maas, dtype: float64

In [165]:
maasDataFrame.isnull() #veriye sahip olmayan var mı (NONE) olan , hata veren var mı diye sorgular

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False

In [166]:
yeniBirVeri={"Karakter Sinifi":["South Park","South Park","Simpson","Simpson"],
            "Karakter Ismi":["Cartman","Kenny","Homer","Bart"],
             "Karakter Yas":[9,10,50,20]
            }

In [167]:
KarakterDataFrame=pd.DataFrame(yeniBirVeri)

In [168]:
KarakterDataFrame

  Karakter Sinifi Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20

In [169]:
KarakterDataFrame.pivot_table(values = "Karakter Yas",index=["Karakter Sinifi","Karakter Ismi"])
#pivot_table() Kullanirken icersine values ve index belirtmek zorundayiz ve alttaki grafigi olusturmaya yarar

                               Karakter Yas
Karakter Sinifi Karakter Ismi
Simpson         Bart                     20
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

aggfunc=np.sum Toplama Methodudur